; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v3)
		(pred_3 ?v1)
		(pred_4 ?v4)
		(pred_6 ?v4)
		(pred_5 ?v1 ?v4)
		(pred_1)
		(pred_2 ?v1))

   (:action op_3
       :parameters  (?v8 ?v6)
       :precondition (and (not-eq ?v8 ?v6) 
                          (pred_4 ?v8) (pred_4 ?v6) (pred_6 ?v8))
       :effect (and  (pred_6 ?v6)
		     (not (pred_6 ?v8))))


   (:action op_2
       :parameters (?v7 ?v2)
       :precondition  (and  (pred_3 ?v7) (pred_4 ?v2)
			    (pred_5 ?v7 ?v2) (pred_6 ?v2) (pred_1))
       :effect (and (pred_2 ?v7)
		    (not (pred_5 ?v7 ?v2)) 
		    (not (pred_1))))

   (:action op_1
       :parameters  (?v7  ?v2)
       :precondition  (and  (pred_3 ?v7) (pred_4 ?v2)
			    (pred_2 ?v7) (pred_6 ?v2))
       :effect (and (pred_5 ?v7 ?v2)
		    (pred_1)
		    (not (pred_2 ?v7)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_02 obj_04 obj_05 
          obj_03 obj_01 
)
(:init
(pred_4 obj_02)
(pred_4 obj_04)
(pred_4 obj_05)
(pred_3 obj_03)
(pred_3 obj_01)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(pred_1)
(pred_5 obj_03 obj_05)
(pred_5 obj_01 obj_04)
(pred_6 obj_02)
)
(:goal
(and
(pred_5 obj_03 obj_02)
(pred_5 obj_01 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_03 obj_02) (pred_6 obj_04))
    (sometime-before  (pred_5 obj_01 obj_05) (pred_6 obj_02))
  )
)
)

; plan
1. (op_3 obj_02 obj_04)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_04)
   goals met: 0 of 2
2. (op_2 obj_01 obj_04)
   deleted: (pred_5 obj_01 obj_04) (pred_1)
   added: (pred_2 obj_01)
   goals met: 0 of 2
3. (op_3 obj_04 obj_05)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_05)
   goals met: 0 of 2
4. (op_1 obj_01 obj_05)
   deleted: (pred_2 obj_01)
   added: (pred_5 obj_01 obj_05) (pred_1)
   goals met: 1 of 2
5. (op_2 obj_03 obj_05)
   deleted: (pred_5 obj_03 obj_05) (pred_1)
   added: (pred_2 obj_03)
   goals met: 1 of 2
6. (op_3 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_02)
   goals met: 1 of 2
7. (op_1 obj_03 obj_02)
   deleted: (pred_2 obj_03)
   added: (pred_5 obj_03 obj_02) (pred_1)
   goals met: 2 of 2
